Tekla Open API Reference for Tekla Structures 2025
TransformationPlane Constructor
Overload List
Name | Description
TransformationPlane()
 Creates a new identity transformation using the global coordinate system.
TransformationPlane(CoordinateSystem)
 Creates a new transformation plane defined by the given coordinate system.
TransformationPlane(Point, Vector, Vector)
 Creates a new transformation plane defined by the given origin and two vectors.
Top
See Also
Reference
TransformationPlane Class
Tekla.Structures.Model Namespace